from PIL import Image
from colorama import Fore, Back, Style, init

# ターミナルカラーを初期化
init(autoreset=True)

# 設定する画像のサイズ（例: 幅100ピクセル、高さ50ピクセル）
new_width = 120
new_height = 40

# 画像のファイルパスを指定
image_path = './image2.jpeg'
image = Image.open(image_path)

# 指定したサイズにリサイズ
image = image.resize((new_width, new_height))

# 幅と高さを取得
width, height = image.size
pixels = image.load()

# アスキー文字のリストとピクセル密度
chars_list = [('M', 0.31), ('W', 0.31), ('@', 0.29), ('%', 0.28), ('N', 0.24), ('B', 0.23), ('$', 0.23), ('0', 0.22), ('w', 0.22), ('G', 0.22), ('m', 0.21), ('R', 0.21), ('&', 0.21), ('6', 0.2), ('9', 0.2), ('D', 0.2), ('H', 0.2), ('Q', 0.2), ('#', 0.2), ('8', 0.19), ('E', 0.19), ('5', 0.18), ('b', 0.18), ('d', 0.18), ('O', 0.18), ('4', 0.17), ('h', 0.17), ('A', 0.17), ('C', 0.17), ('K', 0.17), ('P', 0.17), ('U', 0.17), ('3', 0.16), ('a', 0.16), ('e', 0.16), ('g', 0.16), ('p', 0.16), ('q', 0.16), ('S', 0.16), ('X', 0.16), ('Z', 0.16), ('2', 0.15), ('n', 0.15), ('s', 0.15), ('u', 0.15), ('F', 0.15), ('V', 0.15),
              ('k', 0.14), ('o', 0.14), ('7', 0.12), ('c', 0.12), ('z', 0.12), ('L', 0.12), ('T', 0.12), ('Y', 0.12), ('f', 0.11), ('t', 0.11), ('v', 0.11), ('y', 0.11), ('J', 0.11), ('1', 0.1), ('?', 0.1), ('[', 0.1), ('{', 0.1), ('}', 0.1), ('l', 0.09), ('x', 0.09), ('*', 0.09), ('+', 0.09), (']', 0.09), ('|', 0.09), ('r', 0.08), ('I', 0.08), ('(', 0.08), ('<', 0.08), ('=', 0.08), ('>', 0.08), ('^', 0.08), ('i', 0.07), ('j', 0.07), ('!', 0.06), ('"', 0.06), (')', 0.06), ('~', 0.06), ('/', 0.05), ('\\', 0.05), ("'", 0.03), ('-', 0.02), (':', 0.02), (';', 0.02), (',', 0.01), ('.', 0.01), ('`', 0.01), ('_', 0.0)]

# ピクセルごとのアスキー文字に変換
pixel_list = []
for y in range(height):
    pixel_list_x = []
    for x in range(width):
        pixel = pixels[x, y]
        r, g, b = pixel[:3]  # RGB値
        brightness = sum(pixel[:3]) / (255 * 3)
        closest_char = min(
            chars_list, key=lambda char: abs(char[1] - brightness))[0]

        # ターミナルカラーで文字を表示
        color_code = f"\033[38;2;{r};{g};{b}m"  # ANSIコードによるRGBカラー指定
        pixel_list_x.append(f"{color_code}{closest_char}{Style.RESET_ALL}")
    pixel_list.append("".join(pixel_list_x))

# 結果を表示
for line in pixel_list:
    print(line)
